; domain
(define (domain gripper)
  (:requirements :strips)
  (:predicates
    (room ?r)
    (ball ?b)
    (gripper ?g)
    (at-robby ?r)
    (at ?b ?r)
    (free ?g)
    (carry ?o ?g)
  )

  (:action move
    :parameters (?from ?to)
    :precondition (and (room ?from) (room ?to) (at-robby ?from))
    :effect (and (at-robby ?to)
      (not (at-robby ?from)))
  )

  (:action pick
    :parameters (?obj ?room ?gripper)
    :precondition (and (ball ?obj) (room ?room) (gripper ?gripper)
      (at ?obj ?room) (at-robby ?room) (free ?gripper))
    :effect (and (carry ?obj ?gripper)
      (not (at ?obj ?room))
      (not (free ?gripper)))
  )

  (:action drop
    :parameters (?obj ?room ?gripper)
    :precondition (and (ball ?obj) (room ?room) (gripper ?gripper)
      (carry ?obj ?gripper) (at-robby ?room))
    :effect (and (at ?obj ?room)
      (free ?gripper)
      (not (carry ?obj ?gripper)))
  )
)

; problem
(define (problem evenly_distributed_to_holding_4_8)
    (:domain gripper)
    (:requirements :strips)
    (:objects room1 room2 room3 room4 ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 gripper1 gripper2 gripper3 gripper4 gripper5)
    (:init (room room1) (room room2) (room room3) (room room4) (ball ball1) (ball ball2) (ball ball3) (ball ball4) (ball ball5) (ball ball6) (ball ball7) (ball ball8) (gripper gripper1) (gripper gripper2) (gripper gripper3) (gripper gripper4) (gripper gripper5) (at ball1 room1) (at ball2 room1) (at ball3 room2) (at ball4 room2) (at ball5 room3) (at ball6 room3) (at ball7 room4) (at ball8 room4) (free gripper1) (free gripper2) (free gripper3) (free gripper4) (free gripper5) (at-robby room1))
    (:goal (and (carry ball1 gripper1) (carry ball2 gripper2) (carry ball3 gripper3) (carry ball4 gripper4) (free gripper5)))
)

; plan
1. (pick ball1 room1 gripper1)
   deleted: (at ball1 room1) (free gripper1)
   added: (carry ball1 gripper1)
   goals met: 2 of 5
2. (pick ball2 room1 gripper2)
   deleted: (at ball2 room1) (free gripper2)
   added: (carry ball2 gripper2)
   goals met: 3 of 5
3. (move room1 room2)
   deleted: (at-robby room1)
   added: (at-robby room2)
   goals met: 3 of 5
4. (pick ball3 room2 gripper3)
   deleted: (at ball3 room2) (free gripper3)
   added: (carry ball3 gripper3)
   goals met: 4 of 5
5. (pick ball4 room2 gripper4)
   deleted: (at ball4 room2) (free gripper4)
   added: (carry ball4 gripper4)
   goals met: 5 of 5
